""""
6. В программе генерируется случайное целое число от 0 до 100.
   Пользователь должен его отгадать не более чем за 10 попыток.
   После каждой неудачной попытки должно сообщаться больше
   или меньше введенное пользователем число, чем то, что загадано.
   Если за 10 попыток число не отгадано, то вывести загаданное число.

"""

import random

cor_answer = random.randint(0, 100)

attempts = 0

while (attempts < 10):
    answer = int(input('Введите целое число от 0 до 100: '))
    if answer == cor_answer:
        print('Ура! Верно!')
        break
    elif (answer > cor_answer):
        print('Вы ввели число больше загаданного')
    else:
        print('Вы ввели число меньше загаданного')
    attempts += 1

print(f'Попытки закончились. Правильный ответ был: {cor_answer}')
