""""
4. Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
   Количество элементов (n) вводится с клавиатуры.

"""


def summ_range(cur, n):
    if (n == 1):
        return cur
    return cur + summ_range(cur * (-0.5), n - 1)


n = int(input('Введите кол-во элементов ряда: '))

summ = summ_range(1, n)

print(f'Сумма {n} слагаемых ряда равна {summ}')
