""""
1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,
а должна запрашивать новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
то программа должна сообщать ему об ошибке и снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.

https://drive.google.com/file/d/1knpRW8nYJbYXxmP59guF0j-HH1X6_hi_/view?usp=sharing
"""

while True:
    symbol = input("Введите символ операции, только +, -, *, / или введите '0' для выхода.\n"
                   "Ваш символ: ")
    if symbol == '0':
        break
    elif symbol == '+' or symbol == '-' or symbol == '*' or symbol == '/':
        numb_1 = float(input('Введите первое число: '))
        numb_2 = float(input('Введите второе число: '))
        if symbol == '+':
            print(f'{numb_1} + {numb_2} = {numb_1 + numb_2}')
        elif symbol == '-':
            print(f'{numb_1} - {numb_2} = {numb_1 - numb_2}')
        elif symbol == '*':
            print(f'{numb_1} * {numb_2} = {numb_1 * numb_2}')
        else:
            if numb_2 == 0:
                print('На ноль делить нельзя!')
            else:
                print(f"{numb_1} / {numb_2} = {numb_1 / numb_2}")
    else:
        print('Неверный символ, попробуйте еще раз.')
        continue
