""""
3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.

"""

x1 = float(input('Введите координату х для первой точки: '))
y1 = float(input('Введите координату y для первой точки: '))
x2 = float(input('Введите координату x для второй точки: '))
y2 = float(input('Введите координату y для второй точки: '))

if x1 != x2: # исключим деление на 0
    k = (y2 - y1) / (x2 - x1)
    b = y1 - k * x1
    print(" y = %.2fx + %.2f" % (k, b))
else:
    print('ошибка деления на 0')