""""
2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

"""
a = 5
b = 6

_and_ = a & b
_or_ = a | b
_xor_ = a ^ b
s_l = a << 2
s_r = a >> 2

print(f"Бинарный 'И' оператор для {a} и {b} = {_and_}")
print(f"Бинарный 'ИЛИ' оператор для {a} и {b} = {_or_}")
print(f"Бинарный 'Исключительное ИЛИ' оператор для {a} и {b} = {_xor_}")
print(f"Побитовый сдвиг вправо на 2 для {a} = {s_r}")
print(f"Побитовый сдвиг влево на 2 для {a} = {s_l}")