""""
4. Написать программу, которая генерирует в указанных пользователем границах:
● случайное целое число,
● случайное вещественное число,
● случайный символ. Для каждого из трех случаев пользователь задает свои границы диапазона.
Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.


"""

from random import randint, uniform

d_type = input("Введите тип данных i - (integer), f - (float), c - (characters): ")
st = input("Введите начальное значение: ")
end = input("Введите конечное значение: ")

if d_type == 'i':
    ran = randint(int(st), int(end))
elif d_type == 'f':
    ran = uniform(float(st), float(end))
elif d_type == 'c':
    ran = chr(randint(ord(st), ord(end)))
else:
    ran = f"Введён неверный тип данных '{d_type}'"

print(f"Случайное значение в указанном диапозоне: {ran}")